aaron-bond.better-comments
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
docker.docker
drblury.protobuf-vsc
eamodio.gitlens
editorconfig.editorconfig
esbenp.prettier-vscode
fill-labs.dependi
formulahendry.auto-rename-tag
foxundermoon.next-js
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
gruntfuggly.todo-tree
ionutvmi.path-autocomplete
jebbs.plantuml
mosapride.zenkaku
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ja
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpp-devtools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.sublime-keybindings
ms-vscode.vscode-typescript-next
oderwat.indent-rainbow
pbkit.vscode-pbkit
pomdtr.excalidraw-editor
prisma.prisma
redhat.java
redhat.vscode-yaml
ritwickdey.liveserver
rust-lang.rust-analyzer
saikou9901.evilinspector
saoudrizwan.claude-dev
seatonjiang.gitmoji-vscode
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
takumii.markdowntable
tamasfe.even-better-toml
tauri-apps.tauri-vscode
timonwong.shellcheck
usernamehw.errorlens
vadimcn.vscode-lldb
vitest.explorer
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vue.volar
wakatime.vscode-wakatime
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
